lecture_4/homework/app/controllers/clans/warriors_controller.rb

INSERT INTO "warriors" ("name", "clan_id", "created_at", "updated_at", "preferred_weapon_kind") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Wojtek"], ["clan_id", 1], ["created_at", "2019-04-09 09:05:22.170221"], ["updated_at", "2019-04-09 09:05:22.170221"], ["preferred_weapon_kind", "melee"]]
---
    def create
      warrior = clan.warriors.create!(warrior_params)

SELECT  "clans".* FROM "clans" WHERE "clans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def clan
      @clan ||= Clan.find(params[:clan_id])