lecture_4/homework/app/controllers/clans_controller.rb

  def index
    render json: Clan.all
---
SELECT "clans".* FROM "clans"